
/***************************************************************************************************
*                    (c) Copyright 1992-2017 Embedded Products Research Center
*                                       All Rights Reserved
*
*\File          buf.h
*\Description   缓冲区模块实现，支持条形和环形缓冲区
*\Note          
*\Log           2017.07.11    Ver 1.0    骆兆松
*               创建文件。
***************************************************************************************************/

#ifndef _BUF_H
#define _BUF_H
#include <stdio.h>
#include "string.h"
#include "cmsis_os.h"
#include "type.h"

/***************************************************************************************************
*\Enum          BufModeType
*\Description   缓冲区类型定义
***************************************************************************************************/
typedef enum
{
    BUF_MODE_CYCLE,     /*!<环形*/
    BUF_MODE_LINE,      /*!<条形*/
    BUF_MODE_NONE       /*!<无类型*/
}BufModeType;

/***************************************************************************************************
*\Enum          BufType
*\Description   缓冲区结构定义
***************************************************************************************************/
typedef struct BufType_st
{
    unsigned char *Addr;   /*!<缓冲区地址*/
    unsigned long  Size;   /*!<缓冲区大小*/
    u32             RPos;   /*!<读偏移*/
    u32             WPos;   /*!<写偏移*/
    BufModeType     Mode;   /*!<存储模式*/
}BufType;

/***************************************************************************************************
*\Function      BufInit
*\Description   缓冲区初始化
*\Parameter     addr    缓冲区地址
*\Parameter     size    缓冲区大小
*\Parameter     mode     缓冲区存储模式 BUF_MODE_CYCLE or BUF_MODE_LINE
*\Return        BufType
*\Note          
*               创建函数。
***************************************************************************************************/
BufType BufInit(u8* addr, u32 size, BufModeType mode);

/***************************************************************************************************
*\Function      BufAddData
*\Description   向缓冲区中增加数据
*\Parameter     buf
*\Parameter     src
*\Parameter     len
*\Return        u32
*\Note          
*               创建函数。
***************************************************************************************************/
u32 BufAddData(BufType* buf, u8* src, u32 len);

/***************************************************************************************************
*\Function      BufGetData
*\Description   
*\Parameter     buf
*\Parameter     dst
*\Parameter     start
*\Parameter     len
*\Return        u32  实际获取到的数据长度
*\Note          
*               创建函数。
***************************************************************************************************/
u32 BufGetData(BufType* buf, u8* dst, u32 start, u32 len);

/***************************************************************************************************
*\Function      BufDelHeadData
*\Description   删除缓冲区中数据，从头部开始
*\Parameter     buf
*\Parameter     len
*\Return        u32 实际删除数据长度
*\Note          
***************************************************************************************************/
u32 BufDelHeadData(BufType* buf, u32 len);

/***************************************************************************************************
*\Function      BufClearData
*\Description   清空缓冲区中的所有数据
*\Parameter     buf
*\Return        u32
*\Note          
***************************************************************************************************/
u32 BufClearData(BufType* buf);

/***************************************************************************************************
*\Function      BufGetDataLen
*\Description   获取缓冲区中的数据长度
*\Parameter     buf
*\Return        u32
*\Note          
***************************************************************************************************/
u32 BufGetDataLen(BufType* buf);

/***************************************************************************************************
*\Function      BufGetLeftLen
*\Description   获取缓冲区剩余可用空间
*\Parameter     buf
*\Return        u32
*\Note          
***************************************************************************************************/
u32 BufGetLeftLen(BufType* buf);

#endif /*_BUF_H*/

