/***************************************************************************************************
*                    (c) Copyright 1992-2017 Embedded Products Research Center
*                                       All Rights Reserved
*
*\File          tlib_time.h
*\Description   
*\Note          
*\Log           2017.09.15    Ver 1.0    骆兆松
*               创建文件。
***************************************************************************************************/
#ifndef _TLIB_TIME_H
#define _TLIB_TIME_H
#include "type.h"
#include "tlib_bcd.h"
#pragma pack(1)
typedef struct TIME_st
{
    union
    {
        struct
        {
            u8 Year;    /*!<年*/
            u8 Month;   /*!<月*/
            u8 Day;     /*!<日*/
            u8 Hour;    /*!<时*/
            u8 Minute;  /*!<分*/
            u8 Second;  /*!<秒*/
        }TSt;
        u8 Array[6];    /*!<时间数组*/
    }TUn;
}TIME;
#pragma pack()

#define TIME_WIDTH  (sizeof TIME)   /*!<获取时间结构的长度*/

/***************************************************************************************************
*\Def           INIT_TIME
*\Description   时间初始化宏（00年1月1日0点0分0秒）。
***************************************************************************************************/
#define INIT_TIME   {0x00, 0x01, 0x01, 0x00, 0x00, 0x00}

/***************************************************************************************************
*\Def           INVALID_TIME
*\Description   非法时间初始化宏。
***************************************************************************************************/
#define INVALID_TIME   {0x00, 0x00, 0x00, 0x00, 0x00, 0x00}

/***************************************************************************************************
*\Def           INIT_STAMP
*\Description   时间戳初始化宏（00年1月1日0点0分0秒）。
***************************************************************************************************/
#define INIT_STAMP   1

/***************************************************************************************************
*\Def           ERROR_STAMP
*\Description   错误时间戳。
***************************************************************************************************/
#define ERROR_STAMP   0

/***************************************************************************************************
*time1比time2早
***************************************************************************************************/
#define TIME_EARLY  (1UL<<0)    /*!<time1比time2早*/

/***************************************************************************************************
*time1比time2晚
***************************************************************************************************/
#define TIME_LATE   (1UL<<1)    /*!<time1比time2晚*/

/***************************************************************************************************
*time1与time2相等
***************************************************************************************************/
#define TIME_EQUAL  (1UL<<2)    /*!<time1与time2相等*/


/***************************************************************************************************
*\Ver           InitTime
*\Description   默认基准时间。
***************************************************************************************************/
extern const TIME InitTime; /*!<默认基准时间*/

/***************************************************************************************************
*\Ver           InvalidTime
*\Description   非法时间。
***************************************************************************************************/
extern const TIME InvalidTime; /*!<默认基准时间*/

/***************************************************************************************************
*\Ver           ChineseWeekName
*\Description   中文星期表。
***************************************************************************************************/
extern const u8* ChineseWeekName[]; /*!<中文星期表*/

/***************************************************************************************************
*\Ver           EnglishWeekName
*\Description   英文星期表。
***************************************************************************************************/
extern const u8* EnglishWeekName[]; /*!<英文星期表*/

/***************************************************************************************************
*\Ver           EnWeekName
*\Description   英文简写星期表。
***************************************************************************************************/
extern const u8* EnWeekName[];  /*!<英文简写星期表*/

/***************************************************************************************************
*\Ver           ChineseMonthName
*\Description   中文月分表。
***************************************************************************************************/
extern const u8* ChineseMonthName[];    /*!<中文月分表*/

/***************************************************************************************************
*\Ver           EnglishMonthName
*\Description   英文简写月分表。
***************************************************************************************************/
extern const u8* EnglishMonthName[];    /*!<英文简写月分表*/

/***************************************************************************************************
*DEC时间修改函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeDECAddYears
*\Description   DEC时间加年。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeDECAddYears(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECAddMonths
*\Description   DEC时间加月。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeDECAddMonths(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECAddDays
*\Description   DEC时间加日。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeDECAddDays(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECAddHours
*\Description   DEC时间加小时。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeDECAddHours(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECAddMinutes
*\Description   DEC时间加分钟
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeDECAddMinutes(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECAddSeconds
*\Description   DEC时间加秒。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note
***************************************************************************************************/
bool TimeDECAddSeconds(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECSubYears
*\Description   DEC时间减年。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeDECSubYears(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECSubMonths
*\Description   DEC时间减月。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeDECSubMonths(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECSubDays
*\Description   DEC时间减天。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeDECSubDays(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECSubHours
*\Description   DEC时间减小时。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeDECSubHours(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECSubMinutes
*\Description   DEC时间减分钟。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeDECSubMinutes(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECSubSeconds
*\Description   DEC时间减秒。
*\Parameter     time    时间指针DEC
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeDECSubSeconds(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeDECAdjustYears
*\Description   调整时间的年数。
*\Parameter     time
*\Parameter     years
*\Return        bool
***************************************************************************************************/
bool TimeDECAdjustYears(TIME* time, s32 years);

/***************************************************************************************************
*\Function      TimeDECAdjustMonths
*\Description   调整时间的月数。
*\Parameter     time
*\Parameter     months
*\Return        bool
***************************************************************************************************/
bool TimeDECAdjustMonths(TIME* time, s32 months);

/***************************************************************************************************
*\Function      TimeDECAdjustDays
*\Description   调整时间的天数。
*\Parameter     time
*\Parameter     days
***************************************************************************************************/
bool TimeDECAdjustDays(TIME* time, s32 days);

/***************************************************************************************************
*\Function      TimeDECAdjustHours
*\Description   调整时间的小时数。
*\Parameter     time
*\Parameter     hours
*\Return        bool
*\Log           2012.01.13    Ver 1.0    高峰
*               创建函数。
***************************************************************************************************/
bool TimeDECAdjustHours(TIME* time, s32 hours);

/***************************************************************************************************
*\Function      TimeDECAdjustMinutes
*\Description   调整时间的分钟数。
*\Parameter     time
*\Parameter     minutes
*\Return        bool
***************************************************************************************************/
bool TimeDECAdjustMinutes(TIME* time, s32 minutes);

/***************************************************************************************************
*\Function      TimeDECAdjustSeconds
*\Description   调整时间的秒数。
*\Parameter     time
*\Parameter     seconds
*\Return        bool
*\Note          调整时间范围大约为139年。
***************************************************************************************************/
bool TimeDECAdjustSeconds(TIME* time, s64 seconds);

/***************************************************************************************************
*BCD时间修改函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeDECAddYears
*\Description   BCD时间加年。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeBCDAddYears(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDAddMonths
*\Description   BCD时间加月。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeBCDAddMonths(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDAddDays
*\Description   BCD时间加日。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeBCDAddDays(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDAddHours
*\Description   BCD时间加小时。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeBCDAddHours(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDAddMinutes
*\Description   BCD时间加分钟。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeBCDAddMinutes(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDAddSeconds
*\Description   BCD时间加秒。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeBCDAddSeconds(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDSubYears
*\Description   BCD时间减年。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeBCDSubYears(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDSubMonths
*\Description   BCD时间减月。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
*\Note          1)若计算后日超出上限则取日上限。
***************************************************************************************************/
bool TimeBCDSubMonths(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDSubDays
*\Description   BCD时间减日。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换。
***************************************************************************************************/
bool TimeBCDSubDays(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDSubHours
*\Description   BCD时间减小时。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeBCDSubHours(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDSubMinutes
*\Description   BCD时间减分钟。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeBCDSubMinutes(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeBCDSubSeconds
*\Description   BCD时间减秒。
*\Parameter     time    时间指针BCD
*\Parameter     value   数值
*\Return        bool    是否成功转换
***************************************************************************************************/
bool TimeBCDSubSeconds(TIME* time, u32 value);

/***************************************************************************************************
*\Function      TimeSwap
*\Description   时间交换函数。
*\Parameter     time1   时间指针DEC/BCD
*\Parameter     time2   时间指针DEC/BCD
*\Return        void
*\Note          1)该函数不检查时间参数正确性。
***************************************************************************************************/
void TimeSwap(TIME* time1, TIME* time2);

/***************************************************************************************************
*时间计算函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeSubTimeDEC
*\Description   计算两时间秒差。
*\Parameter     time1   时间结构DEC
*\Parameter     time2   时间结构DEC
*\Return        u32     秒差
*\Note          1)计算结果为绝对值。
*\Note          2)若时间数据错误则返回0，注意：时间相等也返回0。
***************************************************************************************************/
u32 TimeDECSubTime(TIME time1, TIME time2);

/***************************************************************************************************
*\Function      TimeBCDSubTime
*\Description   计算两时间秒差。
*\Parameter     time1   时间结构BCD
*\Parameter     time2   时间结构BCD
*\Return        u32     秒差
*\Note          1)计算结果为绝对值。
*\Note          2)若时间数据错误则返回0，注意：时间相等也返回0。
***************************************************************************************************/
u32 TimeBCDSubTime(TIME time1, TIME time2);

/***************************************************************************************************
*时间类型转换函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeBCDToDEC
*\Description   将BCD时间转为DEC时间。
*\Parameter     time    时间指针BCD
*\Return        bool    是否成功转换
*\Note          1)time为引用，原值会改变。
*\Note          2)若时间数据非法则不转换并返回FALSE。
*\Note          3)本函数已检查时间正确性，无需再次检查。
***************************************************************************************************/
bool TimeBCDToDEC(TIME* time);

/***************************************************************************************************
*\Function      TimeDECToBCD
*\Description   将DEC时间转为BCD时间。
*\Parameter     time    时间指针DEC
*\Return        bool    是否成功转换
*\Note          1)time为引用，原值会改变。
*\Note          2)若时间数据非法则不转换并返回FALSE。
*\Note          3)本函数已检查时间正确性，无需再次检查。
***************************************************************************************************/
bool TimeDECToBCD(TIME* time);

/***************************************************************************************************
*时间比较函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeComp
*\Description   时间比较
*\Parameter     time1       时间指针DEC/BCD，必须是合法的时间。
*\Parameter     time2       时间指针DEC/BCD，必须是合法的时间。
*\Parameter     time_flags  时间比较标志。可以是TIME_EARLY, TIME_EQUAL, TIME_LATE及其相位与的组合。
*\Return        bool        若比较的时间结果符合time_flags标志,则返回TRUE，否则返回FALSE。
*\Note          1)该函数不检查时间参数正确性。
*\Note          2)time为引用，但原值不会改变。
***************************************************************************************************/
bool TimeComp(TIME* time1, TIME* time2, u32 time_flags);

/***************************************************************************************************
*时间查询函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeMonthDays
*\Description   获取某月天数。
*\Parameter     year    年DEC
*\Parameter     month   月DEC
*\Return        u8      本月天数DEC
*\Note          1)若月份错误则默认返回30天。
*\Note          2)默认为21世纪年份。
***************************************************************************************************/
u8 TimeMonthDays(u8 year, u8 month);

/***************************************************************************************************
*\Function      TimeDECMonthDays
*\Description   获取某月天数。
*\Parameter     time    时间结构DEC
*\Return        u8      本月天数DEC
*\Note          1)默认为21世纪年份。
*\Note          2)若时间数据非法则返回0。
***************************************************************************************************/
u8 TimeDECMonthDays(TIME time);

/***************************************************************************************************
*\Function      TimeBCDMonthDays
*\Description   获取某月天数。
*\Parameter     time    时间结构BCD
*\Return        u8      本月天数DEC
*\Note          1)默认为21世纪年份。
*\Note          2)若时间数据非法则返回0。
***************************************************************************************************/
u8 TimeBCDMonthDays(TIME time);

/***************************************************************************************************
*\Function      TimeDECWeekDay
*\Description   获取DEC时间为星期几。
*\Parameter     time    时间结构DEC
*\Return        u8      取值范围：0~7。 0：周一， 6：周日；7代表时间错误。
*\Note          1)若时间数据非法则不查询并返回7。
*\Note          2)使用Zeller公式。
***************************************************************************************************/
u8 TimeDECWeekDay(TIME time);

/***************************************************************************************************
*\Function      TimeBCDWeekDay
*\Description   获取BCD时间为星期几。
*\Parameter     time    时间结构BCD
*\Return        u8      取值范围：0~7。 0：周一， 6：周日；7代表时间错误。
*\Note          1)若时间数据非法则不查询并返回7。
*\Note          2)使用Zeller公式。
***************************************************************************************************/
u8 TimeBCDWeekDay(TIME time);

/***************************************************************************************************
*时间检查函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeDECCheck
*\Description   检查DEC时间是否正确。
*\Parameter     time    时间指针DEC
*\Return        bool    检查结果
***************************************************************************************************/
bool TimeDECCheck(TIME* time);

/***************************************************************************************************
*\Function      TimeBCDCheck
*\Description   检查BCD时间是否正确。
*\Parameter     time    时间指针BCD
*\Return        bool    检查结果
***************************************************************************************************/
bool TimeBCDCheck(TIME* time);

/***************************************************************************************************
*\Function      TimeZeroCheck
*\Description   检查时间是否为0。
*\Parameter     time    时间指针DEC/BCD
*\Return        bool    检查结果
*\Note          1)该函数不检查时间参数正确性。
*\Note          2)用于时间量检查。
***************************************************************************************************/
bool TimeZeroCheck(TIME* time);

/***************************************************************************************************
*时间初始化函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeInit
*\Description   初始化时间
*\Parameter     time    时间指针
*\Return        void
*\Note          1)也可以直接将InitTime赋给时间结构代替本函数。
***************************************************************************************************/
void TimeInit(TIME* time);

/***************************************************************************************************
*时间修正函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeDECFix
*\Description   DEC时间修正
*\Parameter     time    时间指针DEC
*\Return        u8      修正位集合
*\Note          1)将错误的时间按其含义取近似值。
*\Note          2)修正规则：大于上限：取上限。小于下限：取下限。
*\Note          3)该函数不检查时间参数正确性。
***************************************************************************************************/
u8 TimeDECFix(TIME* time);

/***************************************************************************************************
*\Function      TimeBCDFix
*\Description   BCD时间修正
*\Parameter     time    时间指针BCD
*\Return        u8      修正位集合
*\Note          1)将错误的时间按其含义取近似值。
*\Note          2)修正规则：大于上限：取上限。小于下限：取下限。
*\Note            BCD数值非法且小于上限：取下一个正确BCD值，如：0x1F -> 0x20。
*\Note          3)该函数不检查时间参数正确性。
***************************************************************************************************/
u8 TimeBCDFix(TIME* time);

/***************************************************************************************************
*时间转换函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeDECToStamp
*\Description   将DEC时间转为时间戳。
*\Parameter     time    时间结构DEC
*\Return        u32     时间戳
*\Note          1)时间戳为相对基本时间InitTime的秒差+1。
*\Note          2)若时间数据非法则不计算并返回0（ERROR_STAMP）。
***************************************************************************************************/
u32 TimeDECToStamp(TIME time);

/***************************************************************************************************
*\Function      TimeBCDToStamp
*\Description   将BCD时间转为时间戳。
*\Parameter     time    时间结构BCD
*\Return        u32     时间戳
*\Note          1)时间戳为相对基本时间InitTime的秒差+1。
*\Note          2)若时间数据非法则不计算并返回0（ERROR_STAMP）。
***************************************************************************************************/
u32 TimeBCDToStamp(TIME time);

/***************************************************************************************************
*\Function      TimeDECStampToTime
*\Description   将时间戳转为DEC时间。
*\Parameter     stamp   时间戳
*\Return        TIME    时间结构
*\Note          1)时间戳为相对基本时间InitTime的秒差+1。
*\Note          2)若参数stamp（时间戳）为0或1均返回基本时间InitTime。
***************************************************************************************************/
TIME TimeDECStampToTime(u32 stamp);

/***************************************************************************************************
*\Function      TimeBCDStampToTime
*\Description   将时间戳转为BCD时间。
*\Parameter     stamp   时间戳
*\Return        TIME    时间结构
*\Note          1)时间戳为相对基本时间InitTime的秒差+1。
*\Note          2)若参数stamp（时间戳）为0或1均返回基本时间InitTime。
***************************************************************************************************/
TIME TimeBCDStampToTime(u32 stamp);

/***************************************************************************************************
*时间量函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeValueToSecond
*\Description   将时间量转换为秒。
*\Parameter     time            时间结构DEC
*\Parameter     year_seconds    年时长
*\Parameter     month_seconds   月时长
*\Return        u32             秒
*\Note          1)该函数不检查时间参数正确性。
*\Note          2)年时长和秒时长建议使用时间宏。
***************************************************************************************************/
u32 TimeValueToSecond(TIME time, u32 year_seconds, u32 month_seconds);

/***************************************************************************************************
*时间单元函数
***************************************************************************************************/

/***************************************************************************************************
*\Function      TimeDECToUnit
*\Description   将DEC时间转为单元数值。
*\Parameter     unit_num        单元数值指针
*\Parameter     target_time     目标时间
*\Parameter     base_time       单元基准时间
*\Parameter     unit_second     单元时长
*\Parameter     fill            填补剩余时间为1个单元
*\Return        s32             单元数值（可能为负）
*\Note          1)函数作用：计算距target_time最近的1个单元点。
*\Note          2)target_time与单元点重合时结果为0。
*\Note          3)unit_second为1个单元的时间长度，unit_second = 0时所有单元都落在base_time一点上。
*\Note          4)target_time落在两个单元点之间时，target_time比上个单元点多出的时间称为剩余时间。
*\Note          5)fill = TRUE 且剩余时间大于0时，结果为最近的下1个单元点数值。
*\Note          6)fill = FALSE且剩余时间大于0时，结果为最近的上1个单元点数值。
*\Note          7)本函数进行时间正确性检查，非法时间返回FALSE。
***************************************************************************************************/
bool TimeDECToUnit(s32* unit_num, TIME target_time, TIME base_time, u32 unit_second, bool fill);

/***************************************************************************************************
*\Function      TimeDECUnitToTime
*\Description   将时间单元值转为DEC时间。
*\Parameter     target_time     目标时间指针
*\Parameter     base_time       单元基准时间
*\Parameter     unit_second     单元时长
*\Return        bool            转换结果
*\Note
***************************************************************************************************/
bool TimeDECUnitToTime(TIME* target_time, u32 unit_num, TIME base_time, u32 unit_second);

/***************************************************************************************************
*\Function      TimeDECToUnitTime
*\Description   将DEC时间转为单元时间。
*\Parameter     target_time     目标时间指针
*\Parameter     base_time       单元基准时间
*\Parameter     unit_second     单元时长
*\Parameter     fill            填补剩余时间为1个单元
*\Return        bool            转换结果
*\Note          1)函数作用：将target_time改为距target_time最近的1个单元点的时间。
*\Note          2)target_time与单元点重合时不做修改。
*\Note          3)unit_second为1个单元的时间长度，unit_second = 0时所有单元都落在base_time一点上。
*\Note          4)target_time落在2个单元点之间时，target_time比上个单元点多出的时间称为剩余时间。
*\Note          5)fill = TRUE 且剩余时间大于0时，target_time将被改为最近的下1个单元点时间。
*\Note          6)fill = FALSE且剩余时间大于0时，target_time将被改为最近的上1个单元点时间。
*\Note          7)本函数进行时间正确性检查，非法时间返回FALSE。
***************************************************************************************************/
bool TimeDECToUnitTime(TIME* target_time, TIME base_time, u32 unit_second, bool fill);

/***************************************************************************************************
*\Function      TimeSameMinute
*\Description   判断两时间是否处于相同的分钟。
*\Parameter     t1_dec  第一个时间，格式为DEC。
*\Parameter     t2_dec  第二个时间，格式为DEC。
*\Return        bool
***************************************************************************************************/
bool TimeSameMinute(TIME* t1_dec, TIME* t2_dec);

/***************************************************************************************************
*\Function      TimeSameHour
*\Description   判断两时间是否处于相同的小时。
*\Parameter     t1_dec  第一个时间，格式为DEC。
*\Parameter     t2_dec  第二个时间，格式为DEC。
*\Return        bool
***************************************************************************************************/
bool TimeSameHour(TIME* t1_dec, TIME* t2_dec);

/***************************************************************************************************
*\Function      TimeSameDay
*\Description   判断两时间是否处于相同的日。
*\Parameter     t1_dec  第一个时间，格式为DEC。
*\Parameter     t2_dec  第二个时间，格式为DEC。
*\Return        bool
***************************************************************************************************/
bool TimeSameDay(TIME* t1_dec, TIME* t2_dec);

/***************************************************************************************************
*\Function      TimeSameDay
*\Description   判断两时间是否处于相同的月。
*\Parameter     t1_dec  第一个时间，格式为DEC。
*\Parameter     t2_dec  第二个时间，格式为DEC。
*\Return        bool
***************************************************************************************************/
bool TimeSameMonth(TIME* t1_dec, TIME* t2_dec);

#define ONE_SECOND              (1)     /*!<1秒*/

#define TWO_SECOND              (2)     /*!<2秒*/

#define THREE_SECOND            (3)     /*!<3秒*/

#define FOUR_SECOND             (4)     /*!<4秒*/

#define FIVE_SECOND             (5)     /*!<5秒*/

#define SIX_SECOND              (6)     /*!<6秒*/

#define SEVEN_SECOND            (7)     /*!<7秒*/

#define EIGHT_SECOND            (8)     /*!<8秒*/

#define NINE_SECOND             (9)     /*!<9秒*/

#define TEN_SECOND              (10)     /*!<10秒*/

#define HALF_MINUTE             (30)     /*!<半分钟秒数*/

#define ONE_MINUTE              (60)     /*!<1分钟秒数*/

#define TWO_MINUTE              (60 * 2)     /*!<2分钟秒数*/

#define QUARTER_HOUR            (60 * 15)     /*!<15分钟秒数*/

#define HALF_HOUR               (60 * 30)     /*!<半小时秒数*/

#define THREE_QUARTERS_HOUR     (60 * 45)     /*!<45分钟秒数*/

#define ONE_HOUR                (60 * 60)     /*!<1小时秒数*/

#define HALF_DAY                (60 * 60 * 12)     /*!<半日秒数*/

#define ONE_DAY                 (60 * 60 * 24)     /*!<1日秒数*/

#define ONE_WEEK                (60 * 60 * 24 * 7)     /*!<1周秒数*/

#define ONE_BIG_MONTH           (60 * 60 * 24 * 31)     /*!<1大月秒数*/

#define ONE_SMALL_MONTH         (60 * 60 * 24 * 30)     /*!<1小月秒数*/

#define ONE_COMMON_FEB          (60 * 60 * 24 * 28)     /*!<1平2月秒数*/

#define ONE_LEAP_FEB            (60 * 60 * 24 * 29)     /*!<1闰2月秒数*/

#define ONE_COMMON_YEAR         (60 * 60 * 24 * 365)     /*!<1平年秒数*/

#define ONE_LEAP_YEAR           (60 * 60 * 24 * 366)     /*!<1闰年秒数*/


/***************************************************************************************************
*分单位时间量
***************************************************************************************************/

#define ONE_HOUR_MINUTE         (60)     /*!<1小时分钟数*/

#define TWO_HOUR_MINUTE         (60 * 2)     /*!<2小时分钟数*/

#define THREE_HOUR_MINUTE       (60 * 3)     /*!<3小时分钟数*/

#define FOUR_HOUR_MINUTE        (60 * 4)     /*!<4小时分钟数*/

#define FIVE_HOUR_MINUTE        (60 * 5)     /*!<5小时分钟数*/

#define SIX_HOUR_MINUTE         (60 * 6)     /*!<6小时分钟数*/

#define SEVEN_HOUR_MINUTE       (60 * 7)     /*!<7小时分钟数*/

#define EIGHT_HOUR_MINUTE       (60 * 8)     /*!<8小时分钟数*/

#define NINE_HOUR_MINUTE        (60 * 9)     /*!<9小时分钟数*/

#define TEN_HOUR_MINUTE         (60 * 10)     /*!<10小时分钟数*/

#define HALF_DAY_MINUTE         (60 * 12)     /*!<半天分钟数*/

#define ONE_DAY_MINUTE          (60 * 24)     /*!<1天分钟数*/

#define ONE_WEEK_MINUTE         (60 * 24 * 7)     /*!<1周分钟数*/

#define BIG_MONTH_MINUTE        (60 * 24 * 31)     /*!<大月分钟数*/

#define SMALL_MONTH_MINUTE      (60 * 24 * 30)     /*!<小月分钟数*/

#define COMMON_FEB_MINUTE       (60 * 24 * 28)     /*!<平年2月分钟数*/

#define LEAP_FEB_MINUTE         (60 * 24 * 29)     /*!<闰年2月分钟数*/

#define COMMON_YEAR_MINUTE      (60 * 24 * 365)     /*!<平年分钟数*/

#define LEAP_YEAR_MINUTE        (60 * 24 * 366)     /*!<闰年分钟数*/


/***************************************************************************************************
*时单位时间量
***************************************************************************************************/

#define HALF_DAY_HOUR           (12)     /*!<半天小时数*/

#define ONE_DAY_HOUR            (24)     /*!<1天小时数*/

#define ONE_WEEK_HOUR           (24 * 7)     /*!<1周小时数*/

#define BIG_MONTH_HOUR          (24 * 31)     /*!<1大月小时数*/

#define SMALL_MONTH_HOUR        (24 * 30)     /*!<1小月小时数*/

#define COMMON_FEB_HOUR         (24 * 28)     /*!<平2月小时数*/

#define LEAP_FEB_HOUR           (24 * 29)     /*!<闰2月时数*/

#define COMMON_YEAR_HOUR        (24 * 365)     /*!<平年小时数*/

#define LEAP_YEAR_HOUR          (24 * 366)     /*!<闰年小时数*/


/***************************************************************************************************
*日单位时间量
***************************************************************************************************/


#define COMMON_FEB_DAY          (28)     /*!<平2月天数*/

#define LEAP_FEB_DAY            (29)     /*!<闰2月天数*/

#define SMALL_MONTH_DAY         (30)     /*!<小月天数*/

#define BIG_MONTH_DAY           (31)     /*!<大月天数*/

#define COMMON_YEAR_DAY         (365)     /*!<平年天数*/

#define LEAP_YEAR_DAY           (366)     /*!<闰年天数*/


/***************************************************************************************************
*月单位时间量
***************************************************************************************************/


#define ONE_YEAR_MONTH          (12 * 1)     /*!<1年月数*/

#define TWO_YEAR_MONTH          (12 * 2)     /*!<2年月数*/

#define THREE_YEAR_MONTH        (12 * 3)     /*!<3年月数*/

#define FOUR_YEAR_MONTH         (12 * 4)     /*!<4年月数*/

#define FIVE_YEAR_MONTH         (12 * 5)     /*!<5年月数*/

#define SIX_YEAR_MONTH          (12 * 6)     /*!<6年月数*/

#define SEVEN_YEAR_MONTH        (12 * 7)     /*!<7年月数*/

#define EIGHT_YEAR_MONTH        (12 * 8)     /*!<8年月数*/

#define NINE_YEAR_MONTH         (12 * 9)     /*!<9年月数*/

#define TEN_YEAR_MONTH          (12 * 10)     /*!<10年月数*/

#define CENTURY_MONTH           (12 * 100)     /*!<100年月数*/


/***************************************************************************************************
*年单位时间量
***************************************************************************************************/

#define CENTURY_YEAR            (100)     /*!<1世纪年数*/


/***************************************************************************************************
*毫秒单位时间量
***************************************************************************************************/

#define ONE_MS                  (1)     /*!<1毫秒*/

#define THREE_MS                (3)     /*!<3毫秒*/

#define FOUR_MS                 (4)     /*!<4毫秒*/

#define FIVE_MS                 (5)     /*!<5秒*/

#define SIX_MS                  (6)     /*!<6毫秒*/

#define SEVEN_MS                (7)     /*!<7毫秒*/

#define EIGHT_MS                (8)     /*!<8毫秒*/

#define NINE_MS                 (9)     /*!<9毫秒*/

#define TEN_MS                  (10)     /*!<10毫秒*/

#define QUARTER_SECOND_MS       (250)     /*!<250毫秒*/

#define HALF_SECOND_MS          (500)     /*!<半秒毫秒数*/

#define ONE_SECOND_MS           (1000 * 1)     /*!<1秒毫秒数*/

#define TWO_SECOND_MS           (1000 * 2)     /*!<2秒毫秒数*/

#define THREE_SECOND_MS         (1000 * 3)     /*!<1秒*/

#define FOUR_SECOND_MS          (1000 * 4)     /*!<4秒毫秒数*/

#define FIVE_SECOND_MS          (1000 * 5)     /*!<5秒*/

#define SIX_SECOND_MS           (1000 * 6)     /*!<6秒毫秒数*/

#define SEVEN_SECOND_MS         (1000 * 7)     /*!<7秒毫秒数*/

#define EIGHT_SECOND_MS         (1000 * 8)     /*!<8秒毫秒数*/

#define NINE_SECOND_MS          (1000 * 9)     /*!<9秒毫秒数*/

#define TEN_SECOND_MS           (1000 * 10)     /*!<10秒毫秒数*/

#define QUARTER_MINUTE_MS       (1000 * 15)     /*!<15秒毫秒数*/

#define HALF_MINUTE_MS          (1000 * 30)     /*!<半分钟毫秒数*/

#define ONE_MINUTE_MS           (1000 * 60)     /*!<1分钟毫秒数*/

#define TWO_MINUTE_MS           (1000 * 60 * 2)     /*!<2分钟毫秒数*/

#define QUARTER_HOUR_MS         (1000 * 60 * 15)     /*!<15分钟毫秒数*/

#define HALF_HOUR_MS            (1000 * 60 * 30)     /*!<半小时毫秒数*/

#define THREE_QUARTERS_HOUR_MS  (1000 * 60 * 45)     /*!<45分钟毫秒数*/

#define ONE_HOUR_MS             (1000 * 60 * 60)     /*!<1小时毫秒数*/

#define HALF_DAY_MS             (1000 * 60 * 60 * 12)     /*!<半日毫秒数*/

#define ONE_DAY_MS              (1000 * 60 * 60 * 24)     /*!<1日毫秒数*/

#define ONE_WEEK_MS             (1000 * 60 * 60 * 24 * 7)     /*!<1周毫秒数*/

#define ONE_BIG_MONTH_MS        (1000 * 60 * 60 * 24 * 31)     /*!<1大月毫秒数*/

#define ONE_SMALL_MONTH_MS      (1000 * 60 * 60 * 24 * 30)     /*!<1小月毫秒数*/

/***************************************************************************************************
*2月毫秒数
***************************************************************************************************/
#define ONE_COMMON_FEB_MS       (1000 * 60 * 60 * 24 * 28)     /*!<平年2月毫秒数*/

#define ONE_LEAP_FEB_MS         (1000 * 60 * 60 * 24 * 29)     /*!<闰年2月毫秒数*/

#define ONE_COMMON_YEAR_MS      (1000 * 60 * 60 * 24 * 365)     /*!<1平年毫秒数*/

#define ONE_LEAP_YEAR_MS        (1000 * 60 * 60 * 24 * 366)     /*!<1闰年毫秒数*/

/***************************************************************************************************
*\Function      StrFTime
*\Description   根据format对格式为TIME的t进行格式化，并存入长度为max_len的buf缓冲区中。
*\Parameter     s
*\Parameter     maxsize
*\Parameter     format
*\Parameter     t
*\Return        u32
*\Note          format的格式定义请参见C标准库strftime的说明。
*\Note          s,U,W,Z格式未实现。
*\Note          c和D中的日期格式为年-月-日。
***************************************************************************************************/
u32 StrFTime(u8* buf, u32 max_len, const u8* format, TIME* t);

/***************************************************************************************************
*\Function      StrTime
*\Description   将TIME类型的t以“年-月-日 时:分:秒”格式进行格式化为字符串并返回。
*\Parameter     t
*\Return        u8*
*\Note          返回的字符串存储在局部静态缓冲区，请不要对其进行写操作。
***************************************************************************************************/
u8* StrTime(TIME* t);

#endif /*_TLIB_TIME_H*/
