/***************************************************************************************************
*                    (c) Copyright 1992-2017 Embedded Products Research Center
*                                       All Rights Reserved
*
*\File          tlib_bcd.h
*\Description   BCD相关操作工具接口
*\Note          
*\Log           2017.09.16    Ver 1.0    骆兆松
*               创建文件。
***************************************************************************************************/
#ifndef _TLIB_BCD_H
#define _TLIB_BCD_H
#include "type.h"
/***************************************************************************************************
*\Function      GetBCDToDECU8
*\Description   BCDu8转为DEC
*\Parameter     bcd BCD值
*\Return        u8  DEC值
***************************************************************************************************/
u8 GetBCDToDECU8(const u8 bcd);

/***************************************************************************************************
*\Function      GetDECToBCDU8
*\Description   DECu8转为BCD
*\Parameter     dec DEC值
*\Return        u8  BCD值
***************************************************************************************************/
u8 GetDECToBCDU8(const u8 dec);

/***************************************************************************************************
*\Function      DECToBCDU8
*\Description   DEC转为BCD
*\Parameter     dec DEC值（指针）
*\Return        void
***************************************************************************************************/
void DECToBCDU8(u8* dec);

/***************************************************************************************************
*\Function      CheckDECToBCD
*\Description   检查用来转为BCD码的DEC码是否正确
*\Parameter     dec     DEC值
*\Return        bool    检查结果
*\Note          判断dec是否小于99
***************************************************************************************************/
bool CheckDECToBCD(u8 dec);

/***************************************************************************************************
*\Function      BCDToDECU8
*\Description   U8BCD转为DEC
*\Parameter     bcd BCD值（指针）
*\Return        void
***************************************************************************************************/
void BCDToDECU8(u8* bcd);

/***************************************************************************************************
*\Function      DECToBCD
*\Description   DEC转为BCD
*\Parameter     dst BCD值存储空间
*\Parameter     len 空间长度
*\Parameter     dec DEC值
*\Return        u8* dst + 实际存储长度
***************************************************************************************************/
u8* DECToBCD(void* dst, u8 len, u64 dec);

/***************************************************************************************************
*\Function      GetDECToBCDU64
*\Description   DECu64转为BCD
*\Parameter     dec DEC值
*\Return        u64 BCD值
***************************************************************************************************/
u64 GetDECToBCDU64(const u64 dec);

/***************************************************************************************************
*\Function      BCDToDECU64
*\Description   U64BCD转为DEC
*\Parameter     bcd BCD值（指针）
*\Return        void
***************************************************************************************************/
void BCDToDECU64(u64* bcd);

/***************************************************************************************************
*\Function      CheckBCD
*\Description   检查BCD码是否正确
*\Parameter     bcd     要检查的BCD码
*\Return        bool    检查结果
***************************************************************************************************/
bool CheckBCD(u8 bcd);

/***************************************************************************************************
*\Function      MemBCDCheck
*\Description   检查内存区域src中len个字节是否均为BCD码。
*\Parameter     src
*\Parameter     len
*\Return        bool
***************************************************************************************************/
bool MemBCDCheck(const u8* src, const u32 len);

/***************************************************************************************************
*\Function      BCDAdd
*\Description   BCD加运算
*\Parameter     bcd     BCD
*\Parameter     value   加数DEC
*\Return        u64     结果BCD
*\Note          1)若BCD错误则停止计算并返回参数bcd。
***************************************************************************************************/
u64 BCDAdd(u64 bcd, u64 value);

/***************************************************************************************************
*\Function      BCDSub
*\Description   BCD减运算
*\Parameter     bcd     BCD
*\Parameter     value   加数DEC
*\Return        u64     结果BCD
*\Note          1)若BCD错误则停止计算并返回参数bcd。
***************************************************************************************************/
u64 BCDSub(u64 bcd, u64 value);

/***************************************************************************************************
*\Function      BCDFix
*\Description   BCD修正
*\Parameter     bcd     数据指针
*\Return        bool    是否被修正
*\Note          1)修正方法：大于0x99修正为0x00；高位合法、低位大于0x09修正为高位进1，低位为0。
***************************************************************************************************/
bool BCDFix(u8* bcd);

/***************************************************************************************************
*\Function      BCDArrayFix
*\Description   BCD数组修正
*\Parameter     bcd     BCD数组指针
*\Return        bool    是否被修正
*\Note          1)修正方法：大于0x99修正为0x00；高位合法、低位大于0x09修正为高位进1，低位为0。
***************************************************************************************************/
bool BCDArrayFix(void* bcd_array, u32 len);

/***************************************************************************************************
*\Function      BCDLeftMov
*\Description   BCD数值左移。
*\Parameter     bcd_array   BCD字节数组
*\Parameter     len         BCD字节数组长度
*\Parameter     mov_num     左移数值个数
*\Return        void
*\Note          1)len为字节长度，包含数值个数为len * 2。
*\Note          2)本函数不检查BCD正确性。
***************************************************************************************************/
void BCDLeftMov(void* bcd_array, u32 len, u32 mov_num);

/***************************************************************************************************
*\Function      BCDRightMov
*\Description   BCD数值右移。
*\Parameter     bcd_array   BCD字节数组
*\Parameter     len         BCD字节数组长度
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)len为字节长度，包含数值个数为len * 2。
*\Note          2)本函数不检查BCD正确性。
***************************************************************************************************/
void BCDRightMov(void* bcd_array, u32 len, u32 mov_num);

/***************************************************************************************************
*\Function      BCDLeftMovU8
*\Description   BCD数值左移。
*\Parameter     bcd         用来存放BCD码的u8整数，里边包含2个BCD码
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u8 BCDLeftMovU8(u8 bcd, u32 mov_num);

/***************************************************************************************************
*\Function      BCDLeftMovU16
*\Description   BCD数值左移。
*\Parameter     bcd         用来存放BCD码的u16整数，里边包含4个BCD码
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u16 BCDLeftMovU16(u16 bcd, u32 mov_num);

/***************************************************************************************************
*\Function      BCDLeftMovU32
*\Description   BCD数值左移。
*\Parameter     bcd         用来存放BCD码的u32整数，里边包含8个BCD码
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u32 BCDLeftMovU32(u32 bcd, u32 mov_num);

/***************************************************************************************************
*\Function      BCDLeftMovU64
*\Description   BCD数值左移。
*\Parameter     bcd         用来存放BCD码的u64整数，里边包含16个BCD码
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u64 BCDLeftMovU64(u64 bcd, u32 mov_num);

/***************************************************************************************************
*\Function      BCDRightMovU8
*\Description   BCD数值右移。
*\Parameter     bcd         用来存放BCD码的u8整数，里边包含2个BCD码
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u8 BCDRightMovU8(u8 bcd, u32 mov_num);

/***************************************************************************************************
*\Function      BCDRightMovU16
*\Description   BCD数值右移。
*\Parameter     bcd         用来存放BCD码的u16整数，里边包含4个BCD码
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u16 BCDRightMovU16(u16 bcd, u32 mov_num);

/***************************************************************************************************
*\Function      BCDRightMovU32
*\Description   BCD数值右移。
*\Parameter     bcd         用来存放BCD码的u32整数，里边包含8个BCD码
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u32 BCDRightMovU32(u32 bcd, u32 mov_num);

/***************************************************************************************************
*\Function      BCDRightMovU64
*\Description   BCD数值右移。
*\Parameter     bcd         用来存放BCD码的u68整数，里边包含16个BCD码
*\Parameter     mov_num     右移数值个数
*\Return        void
*\Note          1)本函数不检查BCD正确性。
***************************************************************************************************/
u64 BCDRightMovU64(u64 bcd, u32 mov_num);

#endif /*_TLIB_BCD_H*/
