/***************************************************************************************************
*                    (c) Copyright 1992-2008 Embedded Products Research Center
*                                       All Rights Reserved
*
*\File          type.h
*\Description   类型定义
*\Note
*\Log           2010.12.17    Ver 1.0    毕文
*               创建文件。
***************************************************************************************************/
#ifndef _TYPE_H
#define _TYPE_H

/***************************************************************************************************
*类型
***************************************************************************************************/

typedef unsigned long long          u64;    /*!<u64*/
typedef unsigned int                u32;    /*!<u32*/
typedef unsigned short              u16;    /*!<u16*/
typedef unsigned char               u8;     /*!<u8*/

typedef signed long long            s64;    /*!<s64*/
typedef signed int                  s32;    /*!<s32*/
typedef signed short                s16;    /*!<s16*/
typedef signed char                 s8;     /*!<s8*/

typedef volatile unsigned int       vu32;   /*!<vu32*/
typedef volatile unsigned short     vu16;   /*!<vu16*/
typedef volatile unsigned char      vu8;    /*!<vu8*/

typedef volatile signed int         vs32;   /*!<vs32*/
typedef volatile signed short       vs16;   /*!<vs16*/
typedef volatile signed char        vs8;    /*!<vs8*/

#ifdef CPU_WIDE_64
typedef u64 uCpu;
#else
typedef u32 uCpu;
#endif


#ifdef TRUE
#undef TRUE
#endif
#ifdef FALSE
#undef FALSE
#endif

/***************************************************************************************************
*\Enum          bool
*\Description   bool类型的定义
***************************************************************************************************/
typedef enum
{
    FALSE = 0,      /*!<FALSE，假*/
    TRUE = !FALSE   /*!<TRUE，真*/
}bool;

#ifdef NULL
#undef NULL
#endif

#define NULL 0  /*!<NULL的定义*/

/***************************************************************************************************
*值
***************************************************************************************************/

#define S8_MIN  (-127 - 1)  /*!<s8最小值定义*/
#define S8_MAX  127         /*!<s8最大值定义*/
#define U8_MAX  0xFF        /*!<u8最大值定义*/
#define S16_MIN (-32768)    /*!<s16最小值定义*/
#define S16_MAX 32767       /*!<s16最大值定义*/
#define U16_MAX 0xFFFF      /*!<u16最大值定义*/
#define S32_MIN (-2147483647L - 1)              /*!<s32最小值定义*/
#define S32_MAX 2147483647L                     /*!<s32最大值定义*/
#define U32_MAX 0xFFFFFFFF                      /*!<u32最大值定义*/
#define S64_MIN (-9223372036854775807LL - 1)    /*!<s64最小值定义*/
#define S64_MAX 9223372036854775807LL           /*!<s64最大值定义*/
#define U64_MAX 0xFFFFFFFFFFFFFFFF              /*!<u64最大值定义*/

/***************************************************************************************************
*程序结构
***************************************************************************************************/
#define DEAD_LOOP while(1)      /*!<while死循环定义*/

/*!<函数单次运行标志*/
#define ONCE_RUN(name, ret) {static bool name##_once_run = FALSE;\
    if (name##_once_run == TRUE) {return ret;} name##_once_run = TRUE;}

#define VOID_RET    /*!<空return*/

/***************************************************************************************************
*变参
***************************************************************************************************/
#include <stdarg.h>

typedef va_list VAListType;     /*!<变参类型定义*/

#define VA_START(ap, v) va_start(ap, v)  /*!<获取变参的起始参数地址*/


#define VA_ARG(ap, t)   va_arg(ap, t)    /*!<获取参数地址*/

#define VA_END(ap)      va_end(ap)       /*!<清空变参的参数地址*/

/***************************************************************************************************
*工具
***************************************************************************************************/
#ifdef offsetof
#undef offsetof
#endif
#define offsetof(s, m)      ((uCpu)&(((s*)0)->m))   /*!<获取结构类型中某成员的偏移*/
#define offsetofvar(s, m)   ((uCpu)(&(s).(m) - &(s)))     /*!<获取结构体变量中某成员的偏移*/
#define sizeofmember(s, m)  (sizeof((s*)0)->m)           /*!<获取结构体中某成员的宽度*/
#define countof(a)          (sizeof(a) / sizeof(a[0]))   /*!<获取数组的元素个数*/
#define numberof(a, p)      ((((uCpu)p) - ((uCpu)&(a[0]))) / sizeof(a[0])) /*!<获取当前元素在数组中的索引位置*/


/***************************************************************************************************
*宏
***************************************************************************************************/
#define ONE_KILO    (1024UL)                /*!<1K的定义*/
#define ONE_MEGA    (ONE_KILO * 1024)       /*!<1M的定义*/
#define ONE_GIGA    (ONE_MEGA * 1024)       /*!<1G的定义*/
#define ONE_TERA    (ONE_GIGA * 1024)       /*!<1T的定义*/
#define ONE_PETA    (ONE_TERA * 1024)       /*!<1P的定义*/
#define ONE_EXA     (ONE_PETA * 1024)       /*!<1E的定义*/
#define ONE_ZETA    (ONE_EXA * 1024)        /*!<1Z的定义*/
#define ONE_YOTTA   (ONE_ZETA * 1024)       /*!<1Y的定义*/
#define ONE_NONA    (ONE_YOTTA * 1024)      /*!<1N的定义*/
#define ONE_DOGGA   (ONE_DOGGA * 1024)      /*!<1D的定义*/

/***************************************************************************************************
*数组批量相同值宏
***************************************************************************************************/
#define V2(V)       (V),        (V)         /*!<2个值的定义*/
#define V4(V)       V2(V),      V2(V)       /*!<4个值的定义*/
#define V8(V)       V4(V),      V4(V)       /*!<8个值的定义*/
#define V16(V)      V8(V),      V8(V)       /*!<16个值的定义*/
#define V32(V)      V16(V),     V16(V)      /*!<32个值的定义*/
#define V64(V)      V32(V),     V32(V)      /*!<64个值的定义*/
#define V128(V)     V64(V),     V64(V)      /*!<128个值的定义*/
#define V256(V)     V128(V),    V128(V)     /*!<256个值的的定义*/
#define V512(V)     V256(V),    V256(V)     /*!<512个值的的定义*/
#define V1024(V)    V512(V),    V512(V)     /*!<1024个值的的定义*/
#define V2048(V)    V1024(V),   V1024(V)    /*!<2048个值的的定义*/
#define V4096(V)    V2048(V),   V2048(V)    /*!<4096个值的的定义*/
#define V8192(V)    V4096(V),   V4096(V)    /*!<8192个值的的定义*/
#define V16384(V)   V8192(V),   V8192(V)    /*!<16384个值的的定义*/
#define V32768(V)   V16384(V),  V16384(V)   /*!<32768个值的的定义*/
#define V65536(V)   V32768(V),  V32768(V)   /*!<65536个值的的定义*/
#define V131072(V)  V65536(V),  V65536(V)   /*!<131072个值的的定义*/
#define V262144(V)  V131072(V), V131072(V)  /*!<262144个值的的定义*/
#define V524288(V)  V262144(V), V262144(V)  /*!<524288个值的的定义*/
#define V1048576(V) V524288(V), V524288(V)  /*!<1048576个值的的定义*/

/***************************************************************************************************
*\Def           Max
*\Description   返回两个参数中的较大值
*\Parameter     x   参数x
*\Parameter     y   参数y
*\Return        u8    两数中的较大值
***************************************************************************************************/
#define Max(x, y) ((x)<(y)?(y):(x))

/***************************************************************************************************
*\Def           Min
*\Description   返回两个参数中的较小值
*\Parameter     x   参数x
*\Parameter     y   参数y
*\Return        u8  两数中的较小值
***************************************************************************************************/
#define Min(x, y) ((x)<(y)?(x):(y))

/***************************************************************************************************
*\Def           Swap
*\Description   交换两个参数的值
*\Parameter     x   参数x
*\Parameter     y   参数y
*\Return        u8
***************************************************************************************************/
#define Swap(a, b) {(a)^=(b); (b)^=(a); (a)^=(b);}
#endif /*_TYPE_H*/


